cf_billing/InformationRegisters/бестОтветственныйПИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестОтветственныйПИР</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОткрытиеМКД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестОтветственныйПИР/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ответственного по ключу помещения.
//
// Параметры:
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
// 
// Возвращаемое значение:
//   СправочникСсылка.Пользователи.
//
Функция ПолучитьОтветственногоПоКлючуПомещения(КлючПомещения) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.Строение КАК Строение
		|ПОМЕСТИТЬ ВТ_Строение
		|ИЗ
		|	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.Ссылка = &КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестОтветственныйПИРСрезПоследних.Строение КАК Строение,
		|	бестОтветственныйПИРСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.бестОтветственныйПИР.СрезПоследних(
		|			,
		|			Строение В
		|				(ВЫБРАТЬ
		|					ВТ_Строение.Строение КАК Строение
		|				ИЗ
		|					ВТ_Строение КАК ВТ_Строение)) КАК бестОтветственныйПИРСрезПоследних";
	
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ответственный;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
КонецФункции

#КонецОбласти

#КонецЕсли
